# -*- coding: utf-8 -*-
"""Вопрос_2.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1UBcqLwLvmX1KMtK_bD_eYLt9P7fkvmuv

# 📋 План проекта

## 🎯 Цели
1. Создать библиотеку для вычисления площадей геометрических фигур
2. Обеспечить  расширяемость для новых фигур
3. Реализовать юнит-тестирование
4. Обеспечить работу метода без знания типа фигуры в compile-time

## 📝 План

### 🔹 1. Проектирование архитектуры
- Определить базовый абстрактный класс `Shape`
- Спроектировать интерфейсы методов: `area()`, `is_valid()`
- Обеспечить систему наследования для новых фигур

### 🔹 2. Реализация основных классов)
- Класс `Circle` с вычислением площади круга
- Класс `Triangle` с вычислением площади по формуле Герона  и проверкой прямоугольного треугольника
- Проверка валидности фигур

### 🔹 3. Функция calculate_area()
- Функция вычисления площади без знания типа фигуры
- Поддержка двух форматов ввода: список и словарь
- Обработка ошибок и валидация входных данных

### 🔹 4. Юнит-тестирование
- Тесты класса `Circle`
- Тесты класса `Triangle`
- Тесты функции `calculate_area()`
- Тесты на обработку ошибок
- Тесты на прямоугольные треугольники

## 📦 Итоговые результаты
1. Модуль geometry_lib.py
2. Набор юнит-тестов
3. Примеры использования библиотеки

## 🔍 Критерии оценки качества
- Все тесты проходят
- Код соответствует PEP8
- Возможность добавлять новые фигуры
- Работа без знания типа фигуры
- Обработка ошибок
"""

'''
Структура проекта

geometry_lib/
├── __init__.py
├── shapes/
│   ├── __init__.py
│   ├── base.py
│   ├── circle.py
│   └── triangle.py
└── tests/
    ├── __init__.py
    ├── test_circle.py
    └── test_triangle.py
'''

"""
Библиотека для вычисления площадей геометрических фигур
"""

import math
from abc import ABC, abstractmethod
from typing import Union, Dict, List, Any
import unittest

class Shape(ABC):
    """Абстрактный базовый класс для всех геометрических фигур"""

    @abstractmethod
    def area(self) -> float:
        """Вычисляет площадь фигуры"""
        pass

    @abstractmethod
    def is_valid(self) -> bool:
        """Проверяет, является ли фигура валидной"""
        pass

class Circle(Shape):
    """Класс для представления круга"""

    def __init__(self, radius: float):
        if radius <= 0:
            raise ValueError("Радиус должен быть положительным числом")
        self.radius = radius

    def area(self) -> float:
        """Вычисляет площадь круга"""
        return math.pi * self.radius ** 2

    def is_valid(self) -> bool:
        """Проверяет валидность круга"""
        return self.radius > 0

    def __str__(self):
        return f"Circle(radius={self.radius})"

class Triangle(Shape):
    """Класс для представления треугольника"""

    def __init__(self, side_a: float, side_b: float, side_c: float):
        self.sides = [side_a, side_b, side_c]

        if any(side <= 0 for side in self.sides):
            raise ValueError("Все стороны должны быть положительными числами")

        if not self._is_triangle_valid():
            raise ValueError("Треугольник с такими сторонами не существует")

    def area(self) -> float:
        """Вычисляет площадь треугольника по формуле Герона"""
        a, b, c = self.sides
        s = (a + b + c) / 2
        return math.sqrt(s * (s - a) * (s - b) * (s - c))

    def is_valid(self) -> bool:
        """Проверяет валидность треугольника"""
        return self._is_triangle_valid()

    def is_right_triangle(self, tolerance: float = 1e-10) -> bool:
        """
        Проверяет, является ли треугольник прямоугольным
        """
        a, b, c = sorted(self.sides)
        return abs(a**2 + b**2 - c**2) < tolerance

    def _is_triangle_valid(self) -> bool:
        """Проверяет неравенство треугольника"""
        a, b, c = self.sides
        return (a + b > c) and (a + c > b) and (b + c > a)

    def __str__(self):
        return f"Triangle(sides={self.sides})"

def calculate_area(shape_data: Union[Dict[str, Any], List[float]]) -> float:
    """
    Вычисляет площадь фигуры без знания типа в compile-time
    """
    if isinstance(shape_data, dict):
        return _create_shape_from_dict(shape_data).area()
    elif isinstance(shape_data, list):
        return _create_shape_from_list(shape_data).area()
    else:
        raise ValueError("Неверный формат данных фигуры")

def _create_shape_from_dict(data: Dict[str, Any]) -> Shape:
    """Создает фигуру из словаря"""
    shape_type = data.get('type')
    params = data.get('params', {})

    if shape_type == 'circle':
        return Circle(**params)
    elif shape_type == 'triangle':
        return Triangle(**params)
    else:
        raise ValueError(f"Неизвестный тип фигуры: {shape_type}")

def _create_shape_from_list(params: List[float]) -> Shape:
    """Создает фигуру из списка параметров"""
    if len(params) == 1:
        return Circle(params[0])
    elif len(params) == 3:
        return Triangle(*params)
    else:
        raise ValueError("Неверное количество параметров для известных фигур")

# Демонстрация работы библиотеки
print("🔷  БИБЛИОТЕКА ГЕОМЕТРИЧЕСКИХ ФИГУР ")
print("=" * 50)

# Демонстрация круга
print("\n🎯 КРУГ:")
circle = Circle(5)
print(f"   Радиус: 5")
print(f"   Площадь: {circle.area():.2f}")
print(f"   Валидный: {circle.is_valid()}")

# Демонстрация треугольника
print("\n🔺 ТРЕУГОЛЬНИК:")
triangle = Triangle(3, 4, 5)
print(f"   Стороны: 3, 4, 5")
print(f"   Площадь: {triangle.area():.2f}")
print(f"   Прямоугольный: {triangle.is_right_triangle()}")
print(f"   Валидный: {triangle.is_valid()}")

# Демонстрация calculate_area
print("\n🎭 ВЫЧИСЛЕНИЕ БЕЗ ЗНАНИЯ ТИПА:")
area1 = calculate_area([2])  # Круг
area2 = calculate_area([3, 4, 5])  # Треугольник
area3 = calculate_area({'type': 'circle', 'params': {'radius': 3}})
area4 = calculate_area({'type': 'triangle', 'params': {'side_a': 6, 'side_b': 8, 'side_c': 10}})

print(f"   calculate_area([2]) = {area1:.2f} (круг)")
print(f"   calculate_area([3,4,5]) = {area2:.2f} (треугольник)")
print(f"   calculate_area(circle радиус=3) = {area3:.2f}")
print(f"   calculate_area(triangle 6-8-10) = {area4:.2f}")

# Проверка прямоугольных треугольников
print("\n📐 ПРОВЕРКА ПРЯМОУГОЛЬНЫХ ТРЕУГОЛЬНИКОВ:")
test_cases = [
    (3, 4, 5, True),
    (5, 12, 13, True),
    (6, 8, 10, True),
    (2, 3, 4, False),
    (5, 5, 5, False),
    (7, 24, 25, True)
]

for a, b, c, expected in test_cases:
    try:
        tri = Triangle(a, b, c)
        is_right = tri.is_right_triangle()
        status = "✓" if is_right == expected else "✗"
        print(f"   {status} {a}-{b}-{c}: {is_right} (ожидалось: {expected})")
    except ValueError as e:
        print(f"   ✗ {a}-{b}-{c}: Ошибка - {e}")

# Юнит-тесты
print("\n" + "=" * 50)
print("🧪 ЗАПУСК ЮНИТ-ТЕСТОВ")
print("=" * 50)

class TestGeometryLibrary(unittest.TestCase):

    def test_circle(self):
        """Тестирование круга"""
        self.assertAlmostEqual(Circle(1).area(), math.pi)
        self.assertAlmostEqual(Circle(2).area(), 4 * math.pi)
        with self.assertRaises(ValueError):
            Circle(0)
        with self.assertRaises(ValueError):
            Circle(-1)

    def test_triangle(self):
        """Тестирование треугольника"""
        self.assertAlmostEqual(Triangle(3, 4, 5).area(), 6.0)
        self.assertTrue(Triangle(3, 4, 5).is_right_triangle())
        self.assertFalse(Triangle(2, 3, 4).is_right_triangle())

        with self.assertRaises(ValueError):
            Triangle(1, 2, 10)
        with self.assertRaises(ValueError):
            Triangle(0, 1, 2)

    def test_calculate_area(self):
        """Тестирование calculate_area"""
        self.assertAlmostEqual(calculate_area([2]), 4 * math.pi)
        self.assertAlmostEqual(calculate_area([3, 4, 5]), 6.0)
        self.assertAlmostEqual(calculate_area({'type': 'circle', 'params': {'radius': 3}}), 9 * math.pi)

        with self.assertRaises(ValueError):
            calculate_area("invalid")
        with self.assertRaises(ValueError):
            calculate_area([1, 2])

    def test_right_triangle_cases(self):
        """Тестирование различных случаев прямоугольных треугольников"""
        # Известные пифагоровы тройки
        self.assertTrue(Triangle(3, 4, 5).is_right_triangle())
        self.assertTrue(Triangle(5, 12, 13).is_right_triangle())
        self.assertTrue(Triangle(7, 24, 25).is_right_triangle())
        self.assertTrue(Triangle(8, 15, 17).is_right_triangle())

        # Не прямоугольные
        self.assertFalse(Triangle(2, 3, 4).is_right_triangle())
        self.assertFalse(Triangle(5, 5, 5).is_right_triangle())
        self.assertFalse(Triangle(4, 5, 6).is_right_triangle())

# Запуск тестов
test_suite = unittest.TestLoader().loadTestsFromTestCase(TestGeometryLibrary)
test_runner = unittest.TextTestRunner(verbosity=2)
test_result = test_runner.run(test_suite)

print("\n" + "=" * 50)
print("🎯 ДОБАВЛЕНИЕ НОВОЙ ФИГУРЫ (ПРИМЕР)")
print("=" * 50)

# Пример добавления новой фигуры - прямоугольника
class Rectangle(Shape):
    """Пример добавления новой фигуры - прямоугольника"""

    def __init__(self, width: float, height: float):
        if width <= 0 or height <= 0:
            raise ValueError("Ширина и высота должны быть положительными")
        self.width = width
        self.height = height

    def area(self) -> float:
        return self.width * self.height

    def is_valid(self) -> bool:
        return self.width > 0 and self.height > 0

    def __str__(self):
        return f"Rectangle({self.width}x{self.height})"

# Демонстрация новой фигуры
print("Добавлен новый класс Rectangle:")
rect = Rectangle(4, 5)
print(f"   Прямоугольник 4x5: площадь = {rect.area()}")
print(f"   Валидный: {rect.is_valid()}")

print("\n" + "=" * 50)
print("✅ БИБЛИОТЕКА ГОТОВА К ИСПОЛЬЗОВАНИЮ!")
print("=" * 50)
print("Доступные классы: Circle, Triangle")
print("Функция: calculate_area()")
print("Методы: area(), is_valid(), is_right_triangle() (для треугольника)")

"""# Geometry Library

Библиотека для вычисления площадей геометрических фигур.

## 📦 Установка

```bash
pip install geometry-lib
"""